-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        10.2.10-MariaDB - mariadb.org binary distribution
-- 服务器操作系统:                      Win64
-- HeidiSQL 版本:                  9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 导出  表 toolsweb.bgu_staffs 结构
DROP TABLE IF EXISTS `bgu_staffs`;
CREATE TABLE IF NOT EXISTS `bgu_staffs` (
  `DBID` int(11) NOT NULL AUTO_INCREMENT,
  `StaffID` char(50) COLLATE utf8_bin DEFAULT NULL,
  `StaffUser` char(20) COLLATE utf8_bin DEFAULT NULL,
  `StaffName` char(50) COLLATE utf8_bin DEFAULT NULL,
  `StaffLevel` char(20) COLLATE utf8_bin DEFAULT NULL,
  `DeptLabel` char(200) COLLATE utf8_bin DEFAULT NULL,
  `DeptDefault` char(100) COLLATE utf8_bin DEFAULT NULL,
  `GroupLabel` char(200) COLLATE utf8_bin DEFAULT NULL,
  `GroupDefault` char(100) COLLATE utf8_bin DEFAULT NULL,
  `StaffRole` char(20) COLLATE utf8_bin DEFAULT '文员',
  `UpAuditor` char(20) COLLATE utf8_bin DEFAULT NULL,
  `Mobiles` char(20) COLLATE utf8_bin DEFAULT NULL,
  `Status` int(1) DEFAULT 0,
  `StatusText` char(4) COLLATE utf8_bin DEFAULT '正常',
  `LastModify` char(20) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`DBID`),
  UNIQUE KEY `StaffID` (`StaffID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- 正在导出表  toolsweb.bgu_staffs 的数据：~60 rows (大约)
DELETE FROM `bgu_staffs`;
/*!40000 ALTER TABLE `bgu_staffs` DISABLE KEYS */;
INSERT INTO `bgu_staffs` (`DBID`, `StaffID`, `StaffUser`, `StaffName`, `StaffLevel`, `DeptLabel`, `DeptDefault`, `GroupLabel`, `GroupDefault`, `StaffRole`, `UpAuditor`, `Mobiles`, `Status`, `StatusText`, `LastModify`) VALUES
	(12, '10359', '周玲燕', '周玲燕', '1', '营销部', NULL, '工程部-文件内务室', '工程部-文件内务室', '文员', '', '17051095060', 0, '正常', NULL),
	(32, '30026', '施宇城', '施宇城', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '17051095060', 0, '正常', NULL),
	(35, '30032', 'Admin', '熊奇龙', '1', '软体部', NULL, '工程部-MIS课', '工程部-MIS课', '文员', '', '17051095060', 0, '正常', NULL),
	(51, '10099', '王启源', '王启源', '1', '软体部', NULL, '工程部-MIS课', '工程部-MIS课', '文员', '', '15058034628', 0, '正常', NULL),
	(52, '10084', '劳亚丹', '劳亚丹', '1', '工程部', NULL, '工程部-秘书课', '工程部-秘书课', '文员', '', '17051095060', 0, '正常', NULL),
	(54, '10012', '周筱龙', '周筱龙', '3', '工程部', '软体部工程单位', '', NULL, '副总', '', '17051099520', 0, '正常', NULL),
	(57, '50026', '曹欣卉', '曹欣卉', '4', '软体部,工程部', '软体部,工程部', '工程部-硬体课', '工程部-硬体课', '采购承办人', '', '17051096666', 1, '正常', NULL),
	(82, '10963', '林丹桂', '林丹桂', '2', '财务部', NULL, '财务部-财务组', '财务部-财务组', '部门主管', '', '17051095060', 1, '正常', NULL),
	(114, '10323', '叶海萍', '叶海萍', '1', '财务部', '财务部', '财务部-财务组', '财务部-财务组', '文员', NULL, '15058085471', 0, '正常', NULL),
	(118, '50004', '张光帷', '张光帷', '2', '软体部', '软体部', '工程部-MIS课', '工程部-MIS课', '部门主管', NULL, '15058524782', 1, '正常', NULL),
	(119, '50104', '张光帷', '张光帷', '1', '软体部', '软体部', '工程部-MIS课', '工程部-MIS课', '文员', NULL, '15058524782', 0, '正常', NULL),
	(142, '10230', '张亮', '张亮', NULL, NULL, NULL, '工程部-MIS课', '工程部-MIS课', '文员', NULL, '17051095060', 0, '正常', NULL),
	(146, '103233', '叶海萍', '叶海萍', '3', '财务部', '财务部', '财务部-财务组', '财务部-财务组', '副总', NULL, '15058085471', 1, '正常', NULL),
	(147, '10130', '张亮', '张亮', '4', '软体部,工程部,营销部,专案部,财务部', '软体部,工程部,营销部,专案部,财务部', '工程部-MIS课', '工程部-MIS课', '资讯承办人', NULL, '17051095060', 1, '正常', NULL),
	(204, '10327', '王光漫', '王光漫', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', NULL),
	(227, '10964', '林丹桂', '林丹桂', '1', '财务部', '财务部', '财务部-财务组', '财务部-财务组', '文员', NULL, '13032568888', 0, '正常', '张光帷'),
	(232, '14338', '林琳', '林琳', '1', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '文员', NULL, '15025522222', 0, '正常', '张光帷'),
	(237, '1016640', '陆峰玲', '陆峰玲', '4', '财务部', '财务部', '管理部-内务组', '管理部-内务组', '采购承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(238, '1016642', '陆峰玲', '陆峰玲', '4', '财务部', '财务部', '管理部-内务组', '管理部-内务组', '行政承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(239, '1016641', '陆峰玲', '陆峰玲', '4', '财务部', '财务部', '管理部-内务组', '管理部-内务组', '资讯承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(241, '1433840', '林琳', '林琳', '4', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '采购承办人', NULL, '15025522222', 1, '正常', '王启源'),
	(242, '1433841', '林琳', '林琳', '4', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '资讯承办人', NULL, '15025522222', 1, '正常', '王启源'),
	(243, '1433842', '林琳', '林琳', '4', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '行政承办人', NULL, '15025522222', 1, '正常', '王启源'),
	(245, '101663', '陆峰玲', '陆峰玲', '3', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '副总', NULL, '15025522222', 1, '正常', '陆峰玲'),
	(247, '10080', '俞田龙', '俞田龙', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', NULL),
	(249, '10093', '熊钰麟', '熊钰麟', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', '陆峰玲'),
	(250, '10090', '熊明惠', '熊明惠', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', NULL),
	(253, '143385', '林琳', '林琳', '5', '管理部', '管理部', '', '', '采购主管', NULL, '15025522222', 1, '正常', '陆峰玲'),
	(254, '102305', '张亮', '张亮', '5', '财务部', '财务部', '工程部-MIS课', '工程部-MIS课', '采购主管', NULL, '17051095060', 1, '正常', '林丹桂'),
	(259, '10046', '李文祥', '李文祥', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15957453482', 0, '正常', '王启源'),
	(260, '10067', '孙良东', '孙良东', '1', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '文员', NULL, '15967850029', 0, '正常', '孙良东'),
	(261, '30018', '师家强', '师家强', NULL, NULL, NULL, '生产部-伺服课', '生产部-伺服课', '文员', NULL, '13616780416', 0, '正常', '王启源'),
	(262, '10340', '邓红安', '邓红安', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13780011607', 0, '正常', '王启源'),
	(263, '10035', '乐晓雯', '乐晓雯', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13567917061', 0, '正常', '王启源'),
	(264, '10135', '刘宋杰', '刘宋杰', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15757482850', 0, '正常', '王启源'),
	(265, '10556', '陈娟', '陈娟', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15158377582', 0, '正常', '王启源'),
	(266, '10091', '叶永茂', '叶永茂', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15888009907', 0, '正常', '王启源'),
	(269, '101662', '陆峰玲', '陆峰玲', '2', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '部门主管', NULL, '15025522222', 1, '正常', '孙良东'),
	(270, '10107', '傅静', '傅静', '1', '生产部', '生产部', '生产部-电控课', '生产部-电控课', '文员', NULL, '13780002986', 0, '正常', '王启源'),
	(271, '100462', '李文祥', '李文祥', '2', '生产部', '生产部', '生产部-电控课', '生产部-电控课', '部门主管', NULL, '15957453482', 1, '正常', '王启源'),
	(272, '300183', '师家强', '师家强', '3', '生产部', '生产部', '', '', '副总', NULL, '13616780416', 1, '正常', '王启源'),
	(274, '1034040', '邓红安', '邓红安', '4', '生产部,客服部', '生产部,客服部', '生产部-电控课', '生产部-电控课', '采购承办人', NULL, '13780011607', 1, '正常', '王启源'),
	(275, '100355', '乐晓雯', '乐晓雯', '5', '工程部,生产部,客服部', '工程部,生产部,客服部', '', '', '采购主管', NULL, '13567917061', 1, '正常', '王启源'),
	(276, '101352', '刘宋杰', '刘宋杰', '2', '工程部', '工程部', '工程部-硬体课', '工程部-硬体课', '部门主管', NULL, '15757482850', 1, '正常', '王启源'),
	(277, '1055640', '陈娟', '陈娟', '4', '工程部', '工程部', '', '', '采购承办人', NULL, '15158377582', 1, '正常', '王启源'),
	(279, '100912', '叶永茂', '叶永茂', '2', '客服部', '客服部', '客服部-客服二课', '客服部-客服二课', '部门主管', NULL, '15888009907', 1, '正常', '王启源'),
	(280, '100913', '叶永茂', '叶永茂', '3', '客服部', '客服部', '客服部-客服二课', '客服部-客服二课', '副总', NULL, '15888009907', 1, '正常', '王启源'),
	(281, '10528', '徐梦瑶', '徐梦瑶', '1', '工程部', '工程部', '工程部-硬体课', '工程部-硬体课', '文员', NULL, '18358490807', 0, '正常', '王启源'),
	(282, '10457', '邵伟利', '邵伟利', '1', '生产部', '生产部', '生产部-伺服课', '生产部-伺服课', '文员', NULL, '1111', 0, '正常', '熊奇龙'),
	(283, '10461', '王海波', '王海波', '1', '客服部', '客服部', '客服部-客服二课', '客服部-客服二课', '文员', NULL, '15258197573', 0, '正常', '王启源'),
	(286, '100807', '俞田龙', '俞田龙', '7', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '', '', '总经理', NULL, '15025522222', 1, '正常', '王启源'),
	(287, '300182', '师家强', '师家强', '2', '生产部', '生产部', '生产部-伺服课,生产部-电控课', '生产部-伺服课,生产部-电控课', '部门主管', NULL, '13616780416', 1, '正常', '熊奇龙'),
	(288, '100908', '熊明惠', '熊明惠', '8', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '', '', 'CEO', NULL, '15025522222', 1, '正常', '王启源'),
	(289, '100939', '熊钰麟', '熊钰麟', '9', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '', '', '董事长', NULL, '15025522222', 1, '正常', '王启源'),
	(291, '103236', '叶海萍', '叶海萍', '6', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '软体部,工程部,营销部,专案部,财务部,管理部,生产部,客服部', '财务部-财务组', '财务部-财务组', '财务总监', NULL, '15058085471', 1, '正常', '俞田龙'),
	(293, '101661', '陆峰玲', '陆峰玲', '1', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '文员', NULL, '15025522222', 0, '正常', '陆峰玲'),
	(294, '1016612', '陆峰玲', '陆峰玲', '2', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '部门主管', NULL, '15025522222', 1, '正常', '陆峰玲'),
	(295, '1016613', '陆峰玲', '陆峰玲', '3', '管理部', '管理部', '管理部-内务组', '管理部-内务组', '副总', NULL, '15025522222', 1, '正常', '陆峰玲'),
	(296, '30029', '谢丽君', '谢丽君', '1', '工程部', '工程部', '工程部-文件内务室', '工程部-文件内务室', '文员', NULL, '17051095060', 0, '正常', '傅静'),
	(297, '10044', '李源', '李源', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15967850033', 0, '正常', NULL),
	(299, '100442', '李源', '李源', '2', '工程部', '工程部', '工程部-产品技术组', '工程部-产品技术组', '部门主管', NULL, '15967850033', 1, '正常', '谢丽君');
/*!40000 ALTER TABLE `bgu_staffs` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
