-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        10.2.10-MariaDB - mariadb.org binary distribution
-- 服务器操作系统:                      Win64
-- HeidiSQL 版本:                  9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 正在导出表  toolsweb.bgu_orig 的数据：~10 rows (大约)
/*!40000 ALTER TABLE `bgu_orig` DISABLE KEYS */;
REPLACE INTO `bgu_orig` (`DBID`, `DeptID`, `DeptName`, `Loacation`, `Status`, `Descript`) VALUES
	(15, '21012598', '营销部', '宁波弘讯科技', 1, '大港'),
	(21, '21022753', '财务部', '宁波弘讯科技', 1, '大港'),
	(24, '21033016', '管理部', '宁波弘讯科技', 1, '大港'),
	(26, '21040241', '生产部', '宁波弘讯科技', 1, '大港'),
	(27, '21040247', '品保部', '宁波弘讯科技', 1, '大港'),
	(28, '21040288', '证券部及董事会', '宁波弘讯科技', 1, '大港'),
	(29, '21040207', '仓储部', '宁波弘讯科技', 1, '大港'),
	(30, '21040650', '专案部', '宁波弘讯科技', 1, '大港'),
	(31, '21040618', '工程部', '宁波弘讯科技', 1, '大港'),
	(32, '21040611', '客服部', '宁波弘讯科技', 1, '大港');
/*!40000 ALTER TABLE `bgu_orig` ENABLE KEYS */;

-- 正在导出表  toolsweb.bgu_orig_detail 的数据：~18 rows (大约)
/*!40000 ALTER TABLE `bgu_orig_detail` DISABLE KEYS */;
REPLACE INTO `bgu_orig_detail` (`DBID`, `DeptID`, `DeptName`, `GroupID`, `GroupName`, `Loacation`, `Status`, `Descript`) VALUES
	(7, '21012266', '软体部', '21011644', 'MIS', '宁波弘讯科技', 1, '大港'),
	(8, '21012266', '软体部', '21011655', '品管组', '宁波弘讯科技', 1, '大港'),
	(12, '21012598', '营销部', '21020213', '业务课', '宁波弘讯科技', 1, '大港'),
	(14, '21022753', '财务部', '21022727', '财务组', '宁波弘讯科技', 1, '大港'),
	(18, '21033016', '管理部', '21033009', '总务组', '宁波弘讯科技', 1, '大港'),
	(19, '21040241', '生产部', '21040246', '伺服课', '宁波弘讯科技', 1, '大港'),
	(20, '21040241', '生产部', '21040294', '电控课', '宁波弘讯科技', 1, '大港'),
	(22, '21040247', '品保部', '21040273', '品保课', '宁波弘讯科技', 1, '大港'),
	(23, '21040288', '证券部及董事会', '21040269', '证券部及董事会课', '宁波弘讯科技', 1, '大港'),
	(25, '21040650', '专案部', '21040699', '专案组', '宁波弘讯科技', 1, '大港'),
	(26, '21040618', '工程部', '21040618', '产品应用部', '宁波弘讯科技', 1, '大港'),
	(27, '21040618', '工程部', '21040623', '系统开发部', '宁波弘讯科技', 1, '大港'),
	(28, '21040618', '工程部', '21040649', '设计验证部', '宁波弘讯科技', 1, '大港'),
	(29, '21040611', '客服部', '21040604', '客服组', '宁波弘讯科技', 1, '大港'),
	(30, '21012598', '营销部', '21040621', '展会课', '宁波弘讯科技', 1, '大港'),
	(31, '21040207', '仓储部', '21040696', '仓储课', '宁波弘讯科技', 1, '大港'),
	(32, '21012598', '营销部', '21040709', '海外组', '宁波弘讯科技', 1, '大港'),
	(33, '21040618', '工程部', '21040753', 'MIS课', '宁波弘讯科技', 1, '大港'),
	(34, '21040618', '工程部', '21040764', '元件组', '宁波弘讯科技', 1, '大港');
/*!40000 ALTER TABLE `bgu_orig_detail` ENABLE KEYS */;

-- 正在导出表  toolsweb.bgu_staffs 的数据：~90 rows (大约)
/*!40000 ALTER TABLE `bgu_staffs` DISABLE KEYS */;
REPLACE INTO `bgu_staffs` (`DBID`, `StaffID`, `StaffUser`, `StaffName`, `StaffLevel`, `DeptLabel`, `DeptDefault`, `GroupLabel`, `GroupDefault`, `StaffRole`, `UpAuditor`, `Mobiles`, `Status`, `StatusText`, `LastModify`) VALUES
	(35, '30032', 'Admin', '熊奇龙', '1', 'MIS', NULL, 'MIS', NULL, '文员', '', '17051095060', 0, '正常', NULL),
	(51, '20099', '王启源', '王启源', '1', '工程部', NULL, '工程部-MIS课', NULL, '文员', '', '15058034628', 0, '正常', NULL),
	(52, '10084', '劳亚丹', '劳亚丹', '1', '工程部', NULL, '工程部-秘书课', NULL, '文员', '', '17051095060', 0, '正常', NULL),
	(82, '10963', '林丹桂', '林丹桂', '2', '财务部', NULL, '财务部-财务组', NULL, '部门主管', '', '17051095060', 1, '正常', NULL),
	(114, '10323', '叶海萍', '叶海萍', '1', '财务部', '财务部', '财务部-财务组', '财务组', '文员', NULL, '15058085471', 0, '正常', NULL),
	(118, '200052', '张胜勇', '张胜勇', '2', '工程部', '工程部', '工程部-MIS课', 'MIS', '部门主管', NULL, '15058524782', 1, '正常', NULL),
	(119, '20005', '张胜勇', '张胜勇', '1', '工程部', '工程部', '工程部-MIS课', 'MIS', '文员', NULL, '15058524782', 0, '正常', NULL),
	(142, '10130', '张亮', '张亮', '1', '工程部', NULL, '工程部-MIS课', NULL, '文员', NULL, '17051095060', 0, '正常', NULL),
	(146, '103233', '叶海萍', '叶海萍', '3', '财务部', '财务部', '财务部-财务组', '财务组', '副总', NULL, '15058085471', 1, '正常', NULL),
	(147, '101304', '张亮', '张亮', '4', '工程部', '工程部,营销部,专案部,财务部', '', '', '资讯承办人', NULL, '17051095060', 1, '正常', NULL),
	(227, '10964', '林丹桂', '林丹桂', '1', '财务部', '财务部', '财务部-财务组', '财务组', '文员', NULL, '13032568888', 0, '正常', '张光帷'),
	(232, '14338', '林琳', '林琳', '1', '管理组', '管理部', '管理组', '管理组', '文员', NULL, '15025522222', 0, '正常', '张光帷'),
	(237, '1016640', '陆峰玲', '陆峰玲', '4', '财务组,管理组', '财务部', '', '财务组,管理组', '采购承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(238, '1016642', '陆峰玲', '陆峰玲', '4', '财务组,管理组', '财务部', '', '财务组,管理组', '行政承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(239, '1016641', '陆峰玲', '陆峰玲', '4', '财务组,管理组', '财务部', '', '财务组,管理组', '资讯承办人', NULL, '15025522222', 1, '正常', '张光帷'),
	(247, '10080', '俞田龙', '俞田龙', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', NULL),
	(249, '10093', '熊钰麟', '熊钰麟', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', '陆峰玲'),
	(250, '10090', '熊明惠', '熊明惠', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15025522222', 0, '正常', NULL),
	(254, '101305', '张亮', '张亮', '5', '工程部', '财务部', '', '财务组', '采购主管', NULL, '17051095060', 1, '正常', '林丹桂'),
	(259, '10046', '李文祥', '李文祥', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15957453482', 0, '正常', '王启源'),
	(260, '10067', '孙良东', '孙良东', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '15967850029', 0, '正常', '孙良东'),
	(261, '30018', '师家强', '师家强', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13616780416', 0, '正常', '王启源'),
	(262, '10340', '邓红安', '邓红安', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13780011607', 0, '正常', '王启源'),
	(263, '10035', '乐晓雯', '乐晓雯', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13567917061', 0, '正常', '王启源'),
	(264, '10135', '刘宋杰', '刘宋杰', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15757482850', 0, '正常', '王启源'),
	(265, '10556', '陈娟', '陈娟', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15158377582', 0, '正常', '王启源'),
	(266, '10091', '叶永茂', '叶永茂', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15888009907', 0, '正常', '王启源'),
	(269, '101662', '陆峰玲', '陆峰玲', '2', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '部门主管', NULL, '15025522222', 1, '正常', '孙良东'),
	(270, '10107', '傅静', '傅静', '1', '生产部', '生产部', '生产部-电控课', '电控课', '文员', NULL, '13780002986', 0, '正常', '王启源'),
	(271, '100462', '李文祥', '李文祥', '2', '生产部', '生产部', '生产部-电控课', '电控课', '部门主管', NULL, '15957453482', 1, '正常', '王启源'),
	(277, '1055640', '陈娟', '陈娟', '4', '', '工程部', '', '', '采购承办人', NULL, '15158377582', 1, '正常', '王启源'),
	(281, '10528', '徐梦瑶', '徐梦瑶', '1', '工程部', '工程部', '工程部-硬体课', '硬体课', '文员', NULL, '18358490807', 0, '正常', '王启源'),
	(282, '10457', '邵伟利', '邵伟利', '1', '生产部', '生产部', '生产部-伺服课', '伺服课', '文员', NULL, '15967803202', 0, '正常', '熊奇龙'),
	(283, '10461', '王海波', '王海波', '1', '客服部', '客服部', '客服部-客服组', '客服部-客服组', '文员', NULL, '15258197573', 0, '正常', '王启源'),
	(287, '300182', '师家强', '师家强', '2', '生产部', '生产部', '伺服课,电控课', '伺服课,电控课', '部门主管', NULL, '13616780416', 1, '正常', '熊奇龙'),
	(293, '10166', '陆峰玲', '陆峰玲', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '15025522222', 0, '正常', '陆峰玲'),
	(305, '10560', '邬雯雯', '邬雯雯', '1', '专案部', '专案部', '专案部-专案组', '专案组', '文员', NULL, '15058400955', 0, '正常', '熊奇龙'),
	(307, '10105', '魏艳红', '魏艳红', '1', '营销部-业务课', '营销部', '营销部-业务课', '业务课', '文员', NULL, '15957450210', 0, '正常', '熊奇龙'),
	(308, '20077', '王信评', '王信评', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13429307517', 0, '正常', NULL),
	(311, '10012', '周筱龙', '周筱龙', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13685702069', 0, '正常', NULL),
	(322, '10570', '祝翠霞', '祝翠霞', '1', '管理部', NULL, '管理部-总务组', NULL, '文员', NULL, '18857819353', 0, '正常', '邓红安'),
	(323, '10618', '朱玲玲', '朱玲玲', '1', '管理部', NULL, '管理部-总务组', NULL, '文员', NULL, '13777227670', 0, '正常', '邓红安'),
	(326, '10005', '靳敏杰', '靳敏杰', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13567917060', 0, '正常', '邓红安'),
	(327, '20088', '刘宜芳', '刘宜芳', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '18858052205', 0, '正常', '邓红安'),
	(328, '100052', '靳敏杰', '靳敏杰', '2', '营销部', '营销部', '营销部-业务课', '营销部-业务课', '部门主管', NULL, '13567917060', 1, '正常', '邓红安'),
	(329, '200882', '刘宜芳', '刘宜芳', '2', '营销部', '营销部', '营销部-展会课', '营销部-展会课', '部门主管', NULL, '18858052205', 1, '正常', '邓红安'),
	(331, '10349', '严婷婷', '严婷婷', '1', '客服部', '客服部', '客服部-客服组', '客服部-客服组', '文员', NULL, '18205849527', 0, '正常', '邓红安'),
	(332, '100912', '叶永茂', '叶永茂', '2', '客服部', '客服部', '客服部-客服组', '客服部-客服组', '部门主管', NULL, '15888009907', 1, '正常', '邓红安'),
	(333, '200883', '刘宜芳', '刘宜芳', '3', '营销部,客服部', '营销部,客服部', '', '', '副总', NULL, '18858052205', 1, '正常', '邓红安'),
	(338, '10620', '林立伟', '林立伟', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13454797972', 0, '正常', '邓红安'),
	(339, '106202', '林立伟', '林立伟', '2', '仓储部', '仓储部', '仓储部-仓储课', '仓储部-仓储课', '部门主管', NULL, '13454797972', 1, '正常', '邓红安'),
	(340, '300183', '师家强', '师家强', '3', '生产部,仓储部', '生产部,仓储部', '生产部-电控课', '生产部-电控课', '副总', NULL, '13616780416', 1, '正常', '傅静'),
	(344, '10508', '贺存军', '贺存军', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '13906626646', 0, '正常', '邓红安'),
	(345, '105085', '贺存军', '贺存军', '5', '仓储部', '仓储部', '仓储部-仓储课', '仓储部-仓储课', '采购主管', NULL, '13906626646', 1, '正常', '邓红安'),
	(347, '200772', '王信评', '王信评', '2', '专案部', '专案部', '专案部-专案组', '专案部-专案组', '部门主管', NULL, '13429307517', 1, '正常', '邓红安'),
	(348, '200773', '王信评', '王信评', '3', '专案部', '专案部', '专案部-专案组', '专案部-专案组', '副总', NULL, '13429307517', 1, '正常', '邓红安'),
	(352, '103236', '叶海萍', '叶海萍', '6', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '', '', '财务总监', NULL, '15058085471', 1, '正常', '傅静'),
	(353, '100807', '俞田龙', '俞田龙', '7', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '财务部-财务组', '财务部-财务组', '总经理', NULL, '15025522222', 1, '正常', '傅静'),
	(354, '100908', '熊明惠', '熊明惠', '8', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '', '', 'CEO', NULL, '15025522222', 1, '正常', '傅静'),
	(355, '100939', '熊钰麟', '熊钰麟', '9', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '营销部,财务部,管理部,生产部,品保部,证券部及董事会,仓储部,专案部,工程部,客服部', '', '', '董事长', NULL, '15025522222', 1, '正常', '傅静'),
	(356, '10166140', '陆峰玲', '陆峰玲', '4', '财务部,管理部', '财务部,管理部', '', '', '采购承办人', NULL, '15025522222', 1, '正常', '傅静'),
	(357, '10166141', '陆峰玲', '陆峰玲', '4', '财务部,管理部', '财务部,管理部', '', '', '资讯承办人', NULL, '15025522222', 1, '正常', '傅静'),
	(358, '10166142', '陆峰玲', '陆峰玲', '4', '财务部,管理部', '财务部,管理部', '', '', '行政承办人', NULL, '15025522222', 1, '正常', '傅静'),
	(359, '1016615', '陆峰玲', '陆峰玲', '5', '财务部,管理部', '财务部,管理部', '', '', '采购主管', NULL, '15025522222', 1, '正常', '傅静'),
	(362, '101352', '刘宋杰', '刘宋杰', '2', '工程部', '工程部', '工程部-产品应用部', '工程部-产品应用部', '部门主管', NULL, '15757482850', 1, '正常', '傅静'),
	(363, '10214', '胡建峰', '胡建峰', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '18768521926', 0, '正常', NULL),
	(365, '100123', '周筱龙', '周筱龙', '3', '工程部', '工程部', '', '', '副总', NULL, '13685702069', 1, '正常', '邓红安'),
	(366, '1034040', '邓红安', '邓红安', '4', '生产部,仓储部,专案部,工程部,客服部', '生产部,仓储部,专案部,工程部,客服部', '生产部-电控课', '生产部-电控课', '采购承办人', NULL, '13780011607', 1, '正常', '邓红安'),
	(367, '1034041', '邓红安', '邓红安', '4', '生产部,仓储部,专案部,工程部,客服部', '生产部,仓储部,专案部,工程部,客服部', '生产部-电控课', '生产部-电控课', '资讯承办人', NULL, '13780011607', 1, '正常', '邓红安'),
	(368, '1034042', '邓红安', '邓红安', '4', '生产部,仓储部,专案部,工程部,客服部', '生产部,仓储部,专案部,工程部,客服部', '生产部-电控课', '生产部-电控课', '行政承办人', NULL, '13780011607', 1, '正常', '邓红安'),
	(369, '100355', '乐晓雯', '乐晓雯', '5', '生产部,专案部,工程部,客服部', '生产部,专案部,工程部,客服部', '生产部-电控课', '生产部-电控课', '采购主管', NULL, '13567917061', 1, '正常', '傅静'),
	(370, '101663', '陆峰玲', '陆峰玲', '3', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '副总', NULL, '15025522222', 1, '正常', '邓红安'),
	(372, '10361', '刘开成', '刘开成', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '13567910029', 0, '正常', '邓红安'),
	(374, '10047', '张长生', '张长生', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '15967850030', 0, '正常', '邓红安'),
	(375, '10033', '何蝶波', '何蝶波', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '15967850028', 0, '正常', '邓红安'),
	(376, '10318', '傅丹盛', '傅丹盛', '1', '管理部', '管理部', '管理部-总务组', '管理部-总务组', '文员', NULL, '13906692194', 0, '正常', '邓红安'),
	(379, '10476', '冯现如', '冯现如', '1', '仓储部', '仓储部', '仓储部-仓储课', '仓储部-仓储课', '文员', NULL, '13958313729', 0, '正常', '邓红安'),
	(380, '10392', '赵录玉', '赵录玉', '1', '仓储部', '仓储部', '仓储部-仓储课', '仓储部-仓储课', '文员', NULL, '15706852696', 0, '正常', '邓红安'),
	(381, '10769', '金江辉', '金江辉', '1', '仓储部', '仓储部', '仓储部-仓储课', '仓储部-仓储课', '文员', NULL, '13592013932', 0, '正常', '邓红安'),
	(383, '10434', '夏秋玲', '夏秋玲', '1', '营销部', '营销部', '营销部-展会课', '营销部-展会课', '文员', NULL, '13957872490', 0, '正常', '邓红安'),
	(384, '1010540', '魏艳红', '魏艳红', '4', '营销部', '营销部', '营销部-业务课,营销部-展会课', '营销部-业务课,营销部-展会课', '采购承办人', NULL, '15957450210', 1, '正常', '邓红安'),
	(385, '1010541', '魏艳红', '魏艳红', '4', '营销部', '营销部', '营销部-业务课,营销部-展会课', '营销部-业务课,营销部-展会课', '资讯承办人', NULL, '15957450210', 1, '正常', '邓红安'),
	(386, '1010542', '魏艳红', '魏艳红', '4', '营销部', '营销部', '营销部-业务课,营销部-展会课', '营销部-业务课,营销部-展会课', '行政承办人', NULL, '15957450210', 1, '正常', '邓红安'),
	(387, '200885', '刘宜芳', '刘宜芳', '5', '营销部', '营销部', '', '', '采购主管', NULL, '18858052205', 1, '正常', '邓红安'),
	(390, '10183', '王梁宏', '王梁宏', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '18768521922', 0, '正常', NULL),
	(391, '10749', '陈竹君', '陈竹君', '1', '营销部', '营销部', '营销部-海外组', '营销部-海外组', '文员', NULL, '18668257869', 0, '正常', '王启源'),
	(392, '101832', '王梁宏', '王梁宏', '2', '营销部', '营销部', '营销部-海外组', '营销部-海外组', '部门主管', NULL, '18768521922', 1, '正常', '王启源'),
	(398, '10044', '李源', '李源', NULL, NULL, NULL, NULL, NULL, '文员', NULL, '15967850033', 0, '正常', '谢丽君'),
	(400, '10327', '王光漫', '王光漫', '1', '工程部', '工程部', '工程部-元件组,工程部-设计验证部', '工程部-元件组,工程部-设计验证部', '文员', NULL, '15968900882', 0, '正常', '谢丽君'),
	(401, '100442', '李源', '李源', '2', '工程部', '工程部', '工程部-元件组', '工程部-元件组', '部门主管', NULL, '15967850033', 1, '正常', '王光漫'),
	(402, '10387', '崔文娇', '崔文娇', '1', '工程部', '工程部', '工程部-产品应用部,工程部-系统开发部,工程部-设计验证部', '工程部-产品应用部,工程部-系统开发部,工程部-设计验证部', '文员', NULL, '15726825853', 0, '正常', '王光漫'),
	(403, '30029', '谢丽君', '谢丽君', '1', '工程部', '工程部', '工程部-产品应用部,工程部-系统开发部,工程部-设计验证部', '工程部-产品应用部,工程部-系统开发部,工程部-设计验证部', '文员', NULL, '17051095060', 0, '正常', '王光漫'),
	(404, '102142', '胡建峰', '胡建峰', '2', '工程部', '工程部', '工程部-系统开发部,工程部-设计验证部', '工程部-系统开发部,工程部-设计验证部', '部门主管', NULL, '18768521926', 1, '正常', '王光漫');
/*!40000 ALTER TABLE `bgu_staffs` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
