var yjSMS_baidu=yjRequire("yujiang.Foil","yjSMS.baidu.js");
console.log("come in testSMS");
/*
	维修收费001

	smsTpl:3ffad050-814a-40a7-8689-35430ceef9b7

	您的维修件共计${count}件维修完毕,维修费${cost}元,请及时付款. 
	收款资料: 公司名称:宁波弘讯科技股份有限公司 
	开户行:宁波银行北仑支行 
	帐号:51010122000144522 (勿现金方式存入) 
	支付宝账户：techmation@aliyun.com（注明单位名称） 
	1.我司仅提供与汇款抬头一致的发票. 
	2.汇款底单请传真至0574-86987286. 我司见传真后发货. 
	3.以上如有不便，请汇至个人帐号： 
	户名：饶志娟 
	开户银行：中国银行红联支行 
	账号：621725 14000 21972346 
	有疑问请致电0574-86987281/86987283转分机510徐小姐
*/

/*
	
	维修收费002
	
	smsTpl:adb893e7-288c-4348-95ef-0d0f6369e6fa

	您的维修件共计${count}件维修完毕,维修费${cost}元.请及时付款 
	弘訊收款資料: 
	公司名稱:弘訊科技股份有限公司 
	公司統編:12508116 
	開戶行:彰化銀行 
	帳號:9658–01–24814900 
	匯款單 請傳真至(02)22181766，如見匯款單發貨 
	如任何疑問,請致電(02)22181686轉分機531陳小姐.
*/

/*
	维修收费003
	
	smsTpl:21142422-44cd-4e73-b43c-1a27b77ee18a

	您的维修件共计${count}件维修完毕,维修费${cost}元,
	请及时付款. 
	弘讯收款资料: 
	银行:中国农业银行阳光支行 
	户名:华蕴 
	帐号:6228 4804 3962 8165 276,(汇此账户时请务必电汇或转账,请勿现金方式存入) 
	提醒：汇款底单请传真至0510-88675038. 
	我司见此传真后发货. 如任何疑问,请致电0510-88675037/88675038
	出貨單已傳真給您,請簽字並回傳至(02)2218-1766 
	如有疑問請致電(02)2218-1686轉分機351陳小姐
*/

var option={
	//18205849527
	phone:"17051095060",
	// //维修收费01
	// templateCode:"smsTpl:3ffad050-814a-40a7-8689-35430ceef9b7",
	// //维修收费02
	// templateCode:"smsTpl:adb893e7-288c-4348-95ef-0d0f6369e6fa",
	//维修收费03
	templateCode:"smsTpl:3ffad050-814a-40a7-8689-35430ceef9b7",
	contentVar:{
		"count":"3",
		"cost":"3000"
	},
	success:function(data){
		console.log(data);
	},
	error:function(err){
		console.log(err);
	}
}

yjSMS_baidu.send(option);


